studyBFR/combustion2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
26600
(
(9.83019 5.03214 -3.75595e-21)
(9.65689 4.94125 -2.13458e-19)
(9.54087 4.85742 -7.16335e-21)
(9.46821 4.79061 1.46356e-19)
(9.40355 4.73496 1.28166e-19)
(9.34056 4.6862 0)
(9.28177 4.64242 2.9405e-21)
(9.22706 4.60287 0)
...
)
;

boundaryField
{
    inlet
    {
        type            groovyBC;
        refValue        nonuniform List<vector> 
40
(
(10 4.5 0)
(10 4.5 0)
(10 4.5 0)
(10 4.5 0)
(10 4.5 0)
(10 4.5 0)
(10 4.5 0)
(10 4.5 0)
...
)
;
        refGradient     uniform (0 0 0);
        valueFraction   uniform 1;
        value           nonuniform List<vector> 
40
(
(10 4.5 0)
(10 4.5 0)
(10 4.5 0)
(10 4.5 0)
(10 4.5 0)
(10 4.5 0)
(10 4.5 0)
(10 4.5 0)
...
)
;
        valueExpression "vector(u,v,0)";
        gradientExpression "vector(0,0,0)";
        fractionExpression "1";
        evaluateDuringConstruction 0;
        variables       
7
(
"cFactor=1;"
"uCenter=(pos().y < 0.015) ? 2.053 : 0;"
"uMiddle=(pos().y >= 0.015 && pos().y < 0.025) ? 4.827 : 0;"
"uSecondary=(pos().y >= 0.025) ? 10 : 0;"
"vSecondary=(pos().y >= 0.025) ? 4.5 : 0;"
"u=cFactor*(uCenter+uMiddle+uSecondary);"
"v=cFactor*(vSecondary);"
)
;
        timelines       (
);
        lookuptables    (
);
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            symmetryPlane;
    }
    fixedWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
