studyBFR/combustion2D/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry               on;

initialChemicalTimeStep 1e-07;

//turbulentReaction       on;

chemistryType
{
    chemistrySolver   ode;
    chemistryThermo   psi;
}

odeCoeffs
{
    solver          SIBS;
    eps             5.0e-2;
    scale           1.0;
}

/*
chemistryType
{
    chemistrySolver   EulerImplicit;
    chemistryThermo   psi;
}


chemistry           on;

initialChemicalTimeStep 1e-07;

EulerImplicitCoeffs
{
    cTauChem        1;
    equilibriumRateLimiter off;
}

odeCoeffs
{
    solver          Rosenbrock43;
    absTol          1e-12;
    relTol          0.01;
}
*/
// ************************************************************************* //
